# Cleaning NY-Housing-Dataset

In [1]:
import pandas as pd
import numpy as np

RAW_PATH = "NY-Housing-Dataset.csv"
df = pd.read_csv(RAW_PATH)

#we make a clean county colum using LOCALITY / SUBLOCALITY 
loc = df["LOCALITY"].astype(str).str.strip()
sub = df["SUBLOCALITY"].astype(str).str.strip()

loc_is_county = loc.str.lower().str.endswith("county")
sub_is_county = sub.str.lower().str.endswith("county")

df["COUNTY"] = pd.NA
df.loc[loc_is_county, "COUNTY"] = loc[loc_is_county]

df.loc[sub_is_county, "COUNTY"] = sub[sub_is_county]
#we get rif of the rows that we dont know the county in
df = df.dropna(subset=["COUNTY"])

df.head()

,BROKERTITLE,TYPE,PRICE,BEDS,BATH,PROPERTYSQFT,ADDRESS,STATE,MAIN_ADDRESS,ADMINISTRATIVE_AREA_LEVEL_2,LOCALITY,SUBLOCALITY,STREET_NAME,LONG_NAME,FORMATTED_ADDRESS,LATITUDE,LONGITUDE,COUNTY
1,Brokered by Serhant,Condo for sale,195000000,7,10.000000,17545.0,Central Park Tower Penthouse-217 W 57th New Yo...,"New York, NY 10019",Central Park Tower Penthouse-217 W 57th New Yo...,United States,New York,New York County,New York,West 57th Street,"217 W 57th St, New York, NY 10019, USA",40.766393,-73.980991,New York County
2,Brokered by Sowae Corp,House for sale,260000,4,2.000000,2015.0,620 Sinclair Ave,"Staten Island, NY 10312","620 Sinclair AveStaten Island, NY 10312",United States,New York,Richmond County,Staten Island,Sinclair Avenue,"620 Sinclair Ave, Staten Island, NY 10312, USA",40.541805,-74.196109,Richmond County
3,Brokered by COMPASS,Condo for sale,69000,3,1.000000,445.0,2 E 55th St Unit 908W33,"Manhattan, NY 10022","2 E 55th St Unit 908W33Manhattan, NY 10022",United States,New York,New York County,New York,East 55th Street,"2 E 55th St, New York, NY 10022, USA",40.761398,-73.974613,New York County
4,Brokered by Sotheby's International Realty - E...,Townhouse for sale,55000000,7,2.373861,14175.0,5 E 64th St,"New York, NY 10065","5 E 64th StNew York, NY 10065",United States,New York,New York County,New York,East 64th Street,"5 E 64th St, New York, NY 10065, USA",40.767224,-73.969856,New York County
5,Brokered by Sowae Corp,House for sale,690000,5,2.000000,4004.0,584 Park Pl,"Brooklyn, NY 11238","584 Park PlBrooklyn, NY 11238",United States,New York,Kings County,Brooklyn,Park Place,"584 Park Pl, Brooklyn, NY 11238, USA",40.674363,-73.958725,Kings County

In [2]:
# the columns that we won't need in the final dataset (NY-Housing-Dataset.csv)
cols_to_drop = [
    "LOCALITY",
    "SUBLOCALITY",
    "STREET_NAME",
    "LONG_NAME",
    "STATE",
    "MAIN_ADDRESS",
    "ADMINISTRATIVE_AREA_LEVEL_2",
    "ADDRESS"
]

df = df.drop(columns=cols_to_drop, errors="ignore")

df.head()

,BROKERTITLE,TYPE,PRICE,BEDS,BATH,PROPERTYSQFT,FORMATTED_ADDRESS,LATITUDE,LONGITUDE,COUNTY
1,Brokered by Serhant,Condo for sale,195000000,7,10.000000,17545.0,"217 W 57th St, New York, NY 10019, USA",40.766393,-73.980991,New York County
2,Brokered by Sowae Corp,House for sale,260000,4,2.000000,2015.0,"620 Sinclair Ave, Staten Island, NY 10312, USA",40.541805,-74.196109,Richmond County
3,Brokered by COMPASS,Condo for sale,69000,3,1.000000,445.0,"2 E 55th St, New York, NY 10022, USA",40.761398,-73.974613,New York County
4,Brokered by Sotheby's International Realty - E...,Townhouse for sale,55000000,7,2.373861,14175.0,"5 E 64th St, New York, NY 10065, USA",40.767224,-73.969856,New York County
5,Brokered by Sowae Corp,House for sale,690000,5,2.000000,4004.0,"584 Park Pl, Brooklyn, NY 11238, USA",40.674363,-73.958725,Kings County

In [3]:
#cleans price by getting rid of rows that are not numbers
df["PRICE"] = pd.to_numeric(df["PRICE"], errors="coerce")
df = df.dropna(subset=["PRICE"])

#slean bath by getting rid of fractions and keeping only full numbers
df["BATH"] = pd.to_numeric(df["BATH"], errors="coerce")
df = df.dropna(subset=["BATH"])
df = df[df["BATH"] % 1 == 0]
df["BATH"] = df["BATH"].astype(int)

# adds ID starting at 1
df = df.reset_index(drop=True)
df.insert(0, "ID", range(1, len(df) + 1))

# saving it in a csv file
CLEAN_PATH = "NY-Housing-Dataset-Cleaned.csv"
df.to_csv(CLEAN_PATH, index=False)


df.head()

,ID,BROKERTITLE,TYPE,PRICE,BEDS,BATH,PROPERTYSQFT,FORMATTED_ADDRESS,LATITUDE,LONGITUDE,COUNTY
0,1,Brokered by Serhant,Condo for sale,195000000,7,10,17545.000000,"217 W 57th St, New York, NY 10019, USA",40.766393,-73.980991,New York County
1,2,Brokered by Sowae Corp,House for sale,260000,4,2,2015.000000,"620 Sinclair Ave, Staten Island, NY 10312, USA",40.541805,-74.196109,Richmond County
2,3,Brokered by COMPASS,Condo for sale,69000,3,1,445.000000,"2 E 55th St, New York, NY 10022, USA",40.761398,-73.974613,New York County
3,4,Brokered by Sowae Corp,House for sale,690000,5,2,4004.000000,"584 Park Pl, Brooklyn, NY 11238, USA",40.674363,-73.958725,Kings County
4,5,Brokered by Douglas Elliman - 575 Madison Ave,Condo for sale,899500,2,2,2184.207862,"157 W 126th St #1b, New York, NY 10027, USA",40.809448,-73.946777,New York County

# Cleaning NY-Schools-Dataset

In [4]:
RAW_PATH = "NY-Schools-Dataset.csv"
schools = pd.read_csv(RAW_PATH)
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [5]:
# we will make sure the percent_tested is numeric and get rid of NaNs
schools["percent_tested"] = pd.to_numeric(
    schools["percent_tested"],
    errors="coerce"
)
# Drop rows that percent_tested not there
schools = schools.dropna(subset=["percent_tested"])

schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7
5,Bard High School Early College,Manhattan,M097,634,641,639,70.8

In [6]:

CLEAN_PATH = "schools_cleaned.csv"

# Save cleaned CSV
schools.to_csv(CLEAN_PATH, index=False)
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7
5,Bard High School Early College,Manhattan,M097,634,641,639,70.8

In [7]:
SCHOOLS_CSV = "schools_cleaned.csv"
LOCS_CSV    = "NY-School-Locations.csv"
DB_PATH     = "ny_project.db"

schools_df = pd.read_csv(SCHOOLS_CSV)
locs_df    = pd.read_csv(LOCS_CSV)

# get column names
schools_df.columns = schools_df.columns.str.strip()
locs_df.columns    = locs_df.columns.str.strip()

conn = sqlite3.connect(DB_PATH)

schools_df.to_sql("schools_raw", conn, if_exists="replace", index=False)
locs_df.to_sql("school_locations_raw", conn, if_exists="replace", index=False)

conn.commit()
conn.close()

In [8]:
import sqlite3
import pandas as pd

DB_PATH = "ny_project.db"
conn = sqlite3.connect(DB_PATH)
cur = conn.cursor()

#make a normalized schools table with a name_key
cur.executescript("""
DROP TABLE IF EXISTS schools_norm;
CREATE TABLE schools_norm AS
SELECT
    *,
    LOWER(TRIM(school_name)) AS name_key
FROM schools_raw;
""")

#making locations table with a name_key
cur.executescript("""
DROP TABLE IF EXISTS school_locations_norm;
CREATE TABLE school_locations_norm AS
SELECT
    *,
    LOWER(TRIM(school)) AS name_key
FROM school_locations_raw;
""")

#join them
cur.executescript("""
DROP TABLE IF EXISTS schools_with_locations;

CREATE TABLE schools_with_locations AS
SELECT
    s.*,     
    l.lat,
    l.long
FROM schools_norm s
LEFT JOIN school_locations_norm l
    ON s.name_key = l.name_key;
""")

conn.commit()

In [9]:
df_preview = pd.read_sql_query("SELECT * FROM schools_with_locations LIMIT 5;", conn)
df_preview

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,name_key,lat,long
0,Essex Street Academy,Manhattan,M445,395,411,387,78.9,essex street academy,40.716778,-73.989337
1,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1,lower manhattan arts academy,40.716778,-73.989337
2,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9,high school for dual language and asian studies,40.716778,-73.989337
3,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7,henry street school for international studies,40.713684,-73.986336
4,Bard High School Early College,Manhattan,M097,634,641,639,70.8,bard high school early college,40.719029,-73.975891

In [5]:
import pandas as pd
import sqlite3

DB_PATH = "ny_project.db"
conn = sqlite3.connect(DB_PATH)

#make a cleaned file where the lat and long are not be NULL
conn.executescript("""
DROP TABLE IF EXISTS schools_locations_clean_sql;

CREATE TABLE schools_locations_clean_sql AS
SELECT *
FROM schools_with_locations
WHERE lat IS NOT NULL
  AND long IS NOT NULL
  AND lat <> 0
  AND long <> 0;
""")

conn.commit()

schools_loc = pd.read_sql_query("SELECT * FROM schools_locations_clean_sql;", conn)
conn.close()

#adding ID collum 
schools_loc = schools_loc.reset_index(drop=True)
schools_loc.insert(0, "ID", range(1, len(schools_loc) + 1))

#calculating the avg performance
schools_loc["overall_score"] = (
    schools_loc[["average_math", "average_reading", "average_writing"]]
    .mean(axis=1)
    .round()
    .astype(int)
)

#will put schools in catagories based on the performance
schools_loc["performance_level"] = pd.qcut(
    schools_loc["overall_score"],
    q=3,
    labels=["Low Performance", "Medium Performance", "High Performance"],
    duplicates="drop"
)

# 4. Save it as a CSV
schools_loc.to_csv("Schools+Locations-Cleaned.csv", index=False)

schools_loc.head()

,ID,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,name_key,lat,long,overall_score,performance_level
0,1,Essex Street Academy,Manhattan,M445,395,411,387,78.9,essex street academy,40.716778,-73.989337,398,Medium Performance
1,2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1,lower manhattan arts academy,40.716778,-73.989337,420,Medium Performance
2,3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9,high school for dual language and asian studies,40.716778,-73.989337,510,High Performance
3,4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7,henry street school for international studies,40.713684,-73.986336,399,Medium Performance
4,5,Bard High School Early College,Manhattan,M097,634,641,639,70.8,bard high school early college,40.719029,-73.975891,638,High Performance

# Cleaning NYPD-Arrest-Crime

In [1]:
import pandas as pd
import numpy as np

RAW_PATH   = "NYPD-Arrest-Crime.csv"
CLEAN_PATH = "NYPD-Arrest-Data-Cleaned.csv"

df = pd.read_csv(RAW_PATH)

#get rid of the nulls
df = df.replace(["(null)", "null", "NULL"], np.nan)

#get rid of the zeros that represnt missing values
cols_where_zero_is_bad = ["X_COORD_CD", "Y_COORD_CD", "Latitude", "Longitude"]
for col in cols_where_zero_is_bad:
    if col in df.columns:
        df[col] = pd.to_numeric(df[col], errors="coerce")
        df[col] = df[col].replace(0, np.nan)

#remove the jurisdiction_code collum 
df = df.drop(columns=["JURISDICTION_CODE"], errors="ignore")

#we will remove some columns we are not using at all
df = df.drop(columns=["PD_CD", "KY_CD", "LAW_CODE"], errors="ignore")
#remove row with NAN
df_clean = df.dropna(how="any")

print("Original rows:", len(df), " Clean rows:", len(df_clean))

#add index ID
df_clean = df_clean.reset_index(drop=True)
df_clean.insert(0, "Index", range(1, len(df_clean) + 1))

df_clean.to_csv(CLEAN_PATH, index=False)

df_clean.head()

Original rows: 212486  Clean rows: 119343

,Index,ARREST_KEY,ARREST_DATE,PD_DESC,OFNS_DESC,LAW_CAT_CD,ARREST_BORO,ARREST_PRECINCT,AGE_GROUP,PERP_SEX,PERP_RACE,X_COORD_CD,Y_COORD_CD,Latitude,Longitude,Location
0,1,299030225,01/07/2025,STRANGULATION 1ST,FELONY ASSAULT,F,M,28,25-44,M,BLACK,997439.0,233857.0,40.808558,-73.952357,POINT (-73.952357 40.808558)
1,2,299533742,01/16/2025,RAPE 2,RAPE,F,K,81,18-24,F,BLACK,1005319.0,190473.0,40.689464,-73.924029,POINT (-73.9240290899499 40.6894642952604)
2,3,299782079,01/21/2025,STRANGULATION 1ST,FELONY ASSAULT,F,M,10,25-44,M,BLACK,984685.0,209908.0,40.742835,-73.998429,POINT (-73.998429 40.742835)
3,4,299961366,01/24/2025,RAPE 3,RAPE,F,S,120,18-24,M,WHITE,962873.0,174172.0,40.644721,-74.077033,POINT (-74.0770327198983 40.6447209438691)
4,5,300834409,02/10/2025,"ARSON 2,3,4",ARSON,F,K,81,25-44,M,BLACK,1005312.0,190540.0,40.689649,-73.924053,POINT (-73.924053 40.689649)

In [3]:
import sqlite3

DB_PATH = "ny_project.db"
CLEAN_PATH = "NYPD-Arrest-Data-Cleaned.csv"

arrests_clean = pd.read_csv(CLEAN_PATH)

conn = sqlite3.connect(DB_PATH)
arrests_clean.to_sql("nypd_arrests_clean", conn, if_exists="replace", index=False)

#make sure there are no null cords
cur = conn.cursor()
cur.execute("""
    DELETE FROM nypd_arrests_clean
    WHERE Latitude IS NULL
       OR Longitude IS NULL
       OR Latitude = 0
       OR Longitude = 0;
""")

conn.commit()

#preview with SQL
preview = pd.read_sql_query("""
    SELECT "Index", ARREST_KEY, ARREST_DATE, ARREST_BORO, OFNS_DESC, Latitude, Longitude
    FROM nypd_arrests_clean
    LIMIT 5;
""", conn)

conn.close()
preview

,Index,ARREST_KEY,ARREST_DATE,ARREST_BORO,OFNS_DESC,Latitude,Longitude
0,1,299030225,01/07/2025,M,FELONY ASSAULT,40.808558,-73.952357
1,2,299533742,01/16/2025,K,RAPE,40.689464,-73.924029
2,3,299782079,01/21/2025,M,FELONY ASSAULT,40.742835,-73.998429
3,4,299961366,01/24/2025,S,RAPE,40.644721,-74.077033
4,5,300834409,02/10/2025,K,ARSON,40.689649,-73.924053

# Cleaning Fire-Department-NYC

In [2]:

# 3.2 stations/sq mile = score 100 bec. thats the avarge in a city
TARGET_DENSITY = 3.2  

csv_path = "Fire-Department-NYC.csv"
df = pd.read_csv(csv_path)

#get rid of duplicates
df = df[df["FacilityName"] != "FacilityName"].copy()

conn = sqlite3.connect("fdny.db")

df.to_sql("FDNYStations", conn, if_exists="replace", index=False)

#SQL will calculate thr raw density and score out of 100
query = f"""
WITH borough_sizes AS (
    SELECT 'Manhattan'     AS Borough, 23  AS SquareMiles UNION ALL
    SELECT 'Brooklyn',          71  UNION ALL
    SELECT 'Queens',           109  UNION ALL
    SELECT 'Bronx',             42  UNION ALL
    SELECT 'Staten Island',     58
),
station_counts AS (
    SELECT
        Borough,
        COUNT(*) AS Stations
    FROM FDNYStations
    GROUP BY Borough
),
raw_scores AS (
    SELECT
        s.Borough,
        s.Stations,
        b.SquareMiles,
        CAST(s.Stations AS FLOAT) / b.SquareMiles AS FD_Score_raw
    FROM station_counts s
    JOIN borough_sizes b USING (Borough)
)
SELECT
    Borough,
    Stations,
    SquareMiles,
    FD_Score_raw,
    -- score out of 100 where 3.2 => 100 (capped at 100 just in case)
    MIN(FD_Score_raw / {TARGET_DENSITY} * 100.0, 100.0) AS FD_Score_100
FROM raw_scores
ORDER BY FD_Score_100 DESC;
"""

scores = pd.read_sql_query(query, conn)

#save it here
scores.to_csv("FDNY-Borough-Scores_Cleaned.csv", index=False)
print("Saved borough scores to FDNY-borough-scores.csv")

conn.close()

Saved borough scores to FDNY-borough-scores.csv

# CLEANING NY-Hospitals-Dataset

In [18]:
import pandas as pd
import sqlite3
import numpy as np
import time 
import requests

# Load the raw hospital file
df = pd.read_csv("NY-Hospitals-Dataset.csv", dtype=str, engine="python")

# Show basic structure
print("Shape:", df.shape)
print("Columns:", len(df.columns))
df.head()

Shape: (45, 39)
Columns: 39

,Facility ID,Facility Name,Address,City/Town,State,ZIP Code,County/Parish,Telephone Number,Hospital Type,Hospital Ownership,...,Count of READM Measures No Different,Count of READM Measures Worse,READM Group Footnote,Pt Exp Group Measure Count,Count of Facility Pt Exp Measures,Pt Exp Group Footnote,TE Group Measure Count,Count of Facility TE Measures,TE Group Footnote,Patient Survey Star Rating
0,330009,BRONXCARE HOSPITAL CENTER,1276 FULTON AVENUE,BRONX,NY,10456,BRONX,(212) 588-7000,Acute Care Hospitals,Voluntary non-profit - Private,...,4,1,NaN,8,8,NaN,12,9,NaN,2.0
1,330014,JAMAICA HOSPITAL MEDICAL CENTER,89TH AVENUE AND VAN WYCK EXPRESSWAY,JAMAICA,NY,11418,QUEENS,(718) 262-6000,Acute Care Hospitals,Voluntary non-profit - Private,...,4,2,NaN,8,8,NaN,12,9,NaN,1.0
2,330019,"NEW YORK COMMUNITY HOSPITAL OF BROOKLYN, INC.",2525 KINGS HIGHWAY,BROOKLYN,NY,11229,KINGS,(718) 692-5302,Acute Care Hospitals,Voluntary non-profit - Private,...,3,3,NaN,8,8,NaN,12,8,NaN,1.0
3,330024,MOUNT SINAI HOSPITAL,ONE GUSTAVE L LEVY PLACE,NEW YORK,NY,10029,NEW YORK,(212) 241-7981,Acute Care Hospitals,Voluntary non-profit - Private,...,11,0,NaN,8,8,NaN,12,11,NaN,3.0
4,330028,RICHMOND UNIVERSITY MEDICAL CENTER,355 BARD AVENUE,STATEN ISLAND,NY,10310,RICHMOND,(718) 354-5047,Acute Care Hospitals,Voluntary non-profit - Private,...,9,1,NaN,8,8,NaN,12,6,NaN,2.0

In [19]:
import sqlite3

conn = sqlite3.connect(":memory:")
df.to_sql("hospitals", conn, if_exists="replace", index=False)

#selecting only the necessary columns
keep_query = """
SELECT
    "Facility ID"              AS "Facility ID",
    "Facility Name"            AS "Facility Name",
    "Address"                  AS "Address",
    "County/Parish"            AS "County/Parish",
    "Hospital overall rating"  AS "Hospital overall rating",
    "Hospital Ownership"       AS "Hospital Ownership",
    "Patient Survey Star Rating" AS "Patient_Survey_Rating"
FROM hospitals;
"""

clean = pd.read_sql_query(keep_query, conn)

print("Shape after column selection:", clean.shape)
print(clean.head())

clean.to_csv("NY-Hospitals-Cleaned.csv", index=False)

Shape after column selection: (45, 7)
  Facility ID                                  Facility Name  \
0      330009                      BRONXCARE HOSPITAL CENTER
1      330014                JAMAICA HOSPITAL MEDICAL CENTER
2      330019  NEW YORK COMMUNITY HOSPITAL OF BROOKLYN, INC.
3      330024                           MOUNT SINAI HOSPITAL
4      330028             RICHMOND UNIVERSITY MEDICAL CENTER

                               Address County/Parish Hospital overall rating  \
0                   1276 FULTON AVENUE         BRONX                       1
1  89TH AVENUE AND VAN WYCK EXPRESSWAY        QUEENS                       1
2                   2525 KINGS HIGHWAY         KINGS                       1
3             ONE GUSTAVE L LEVY PLACE      NEW YORK                       3
4                      355 BARD AVENUE      RICHMOND                       1

               Hospital Ownership Patient_Survey_Rating
0  Voluntary non-profit - Private                   2.0
1  Voluntary non-profit - Private                   1.0
2  Voluntary non-profit - Private                   1.0
3  Voluntary non-profit - Private                   3.0
4  Voluntary non-profit - Private                   2.0

In [20]:
df = pd.read_csv("NY-Hospitals-Cleaned.csv", dtype=str)

#removing hospitals with missing ratings
df["Hospital overall rating"] = pd.to_numeric(
    df["Hospital overall rating"], errors="coerce"
)

df["Patient_Survey_Rating"] = pd.to_numeric(
    df["Patient_Survey_Rating"], errors="coerce"
)

before = df.shape[0]
df = df.dropna(subset=["Hospital overall rating", "Patient_Survey_Rating"])
after = df.shape[0]

print("Dropped:", before - after)
print("Remaining:", after)

df.to_csv("NY-Hospitals-Cleaned.csv", index=False)

Dropped: 12
Remaining: 33

In [22]:
df = pd.read_csv("NY-Hospitals-Cleaned.csv", dtype=str)

county_to_city = {
    "BRONX": "Bronx",
    "KINGS": "Brooklyn",
    "QUEENS": "Queens",
    "RICHMOND": "Staten Island",
    "NEW YORK": "Manhattan"
}

# Function to geocode an address
def geocode_row(row):
    address = str(row["Address"]).strip()
    county = str(row["County/Parish"]).strip().upper()
    city = county_to_city.get(county, county.title())
    parts = [address, city, "NY", "USA"]
    query = ", ".join([p for p in parts if p])

    url = "https://nominatim.openstreetmap.org/search"
    params = {"q": query, "format": "json", "limit": 1}
    headers = {"User-Agent": "nyc-hospitals-ayataje"}

    try:
        r = requests.get(url, params=params, headers=headers, timeout=10)
        data = r.json()
        if data:
            return float(data[0]["lat"]), float(data[0]["lon"])
    except Exception:
        pass
    return None, None

lats = []
lons = []

for i, row in df.iterrows():
    lat, lon = geocode_row(row)
    lats.append(lat)
    lons.append(lon)
    time.sleep(1)

df["Latitude"] = lats
df["Longitude"] = lons

# Adding  manual coords for the latitude and longitude for some hospitals
manual_coords = {
    "330014": (40.702193, -73.809557),   # Jamaica
    "330024": (40.789782, -73.952866),   # Mount Sinai Hospital
    "330193": (40.755095, -73.817901),   # Flushing
    "330194": (40.639774, -73.997246),   # Maimonides
    "330233": (40.656744, -73.913666),   # Brookdale
    "330046": (40.773565, -73.987730),   # Mount Sinai St Luke's Roosevelt
}

for fid, (lat, lon) in manual_coords.items():
    mask = df["Facility ID"].astype(str).str.strip() == fid
    df.loc[mask, "Latitude"] = df.loc[mask, "Latitude"].fillna(lat)
    df.loc[mask, "Longitude"] = df.loc[mask, "Longitude"].fillna(lon)

print(df[["Facility Name", "Address", "County/Parish", "Latitude", "Longitude"]].head())

df.to_csv("NY-Hospitals-Cleaned.csv", index=False)

                                   Facility Name  \
0                      BRONXCARE HOSPITAL CENTER
1                JAMAICA HOSPITAL MEDICAL CENTER
2  NEW YORK COMMUNITY HOSPITAL OF BROOKLYN, INC.
3                           MOUNT SINAI HOSPITAL
4             RICHMOND UNIVERSITY MEDICAL CENTER

                               Address County/Parish   Latitude  Longitude
0                   1276 FULTON AVENUE         BRONX  40.831416 -73.903173
1  89TH AVENUE AND VAN WYCK EXPRESSWAY        QUEENS  40.702193 -73.809557
2                   2525 KINGS HIGHWAY         KINGS  40.613893 -73.948569
3             ONE GUSTAVE L LEVY PLACE      NEW YORK  40.789782 -73.952866
4                      355 BARD AVENUE      RICHMOND  40.636127 -74.105511

In [23]:

df = pd.read_csv("NY-Hospitals-Cleaned.csv")

df["Hospital overall rating"] = pd.to_numeric(df["Hospital overall rating"], errors="coerce")
df["Patient_Survey_Rating"] = pd.to_numeric(df["Patient_Survey_Rating"], errors="coerce")

df["combined_score"] = df[["Hospital overall rating", "Patient_Survey_Rating"]].mean(axis=1)

def classify(score):
    if score >= 4.0:
        return "High quality"
    if score >= 2.5:
        return "Medium quality"
    return "Low quality"

df["Hospital_Quality_Label"] = df["combined_score"].apply(classify)

df = df.drop(columns=["combined_score"])

df.to_csv("NY-Hospitals-Cleaned.csv", index=False)

df.head()

,Facility ID,Facility Name,Address,County/Parish,Hospital overall rating,Hospital Ownership,Patient_Survey_Rating,Latitude,Longitude,Hospital_Quality_Label
0,330009,BRONXCARE HOSPITAL CENTER,1276 FULTON AVENUE,BRONX,1.0,Voluntary non-profit - Private,2.0,40.831416,-73.903173,Low quality
1,330014,JAMAICA HOSPITAL MEDICAL CENTER,89TH AVENUE AND VAN WYCK EXPRESSWAY,QUEENS,1.0,Voluntary non-profit - Private,1.0,40.702193,-73.809557,Low quality
2,330019,"NEW YORK COMMUNITY HOSPITAL OF BROOKLYN, INC.",2525 KINGS HIGHWAY,KINGS,1.0,Voluntary non-profit - Private,1.0,40.613893,-73.948569,Low quality
3,330024,MOUNT SINAI HOSPITAL,ONE GUSTAVE L LEVY PLACE,NEW YORK,3.0,Voluntary non-profit - Private,3.0,40.789782,-73.952866,Medium quality
4,330028,RICHMOND UNIVERSITY MEDICAL CENTER,355 BARD AVENUE,RICHMOND,1.0,Voluntary non-profit - Private,2.0,40.636127,-74.105511,Low quality